// Псевдомассив arguments и Array.from и...


const fn = function () { };

fn(1, 2, 3, 4, 5, 6, 7);

// Напиши функцию add ДЛЯ сложения произвольного количества аргументов(чисел)
//     - Array from()
//     - Операция ... (rest)

const add = function () { };

// console.log(add(1, 2, 3));
// console.log(add(1, 2, 4, 5, 6));


// Напиши функцию filterNumbers(array[, number1, ...]) которая:
//     - первым аргументом принимает массив чисел
//     - после первого аргумента может быть произвольное количество других
// аргументов которые будут числами.
//     - Функция должна вернуть новый массив, в котором будут только
//     re аргументы, начиная CO второго,
//     ДЛЯ которых есть аналог в оригинальном массиве.


const filterNumbers = function () { };
