// приведення до булю на прикладі boolean(value)

console.log(Boolean(5));
console.log(Boolean('oneDay'));
console.log(Boolean(''));
console.log(Boolean(0));

// Логічне І (оператор &&)
// Стопориться на брехні
// повертає те в чому заплуталось, або останній операнд

console.log(5 && 6 && 7 && 'hello!');

// Логічне АБО (оператор !!)
// Стопориться на правді
// повертає те в чому заплуталось, або останній операнд

// Логічне НІ (оператор !)
// Стопориться на брехні
// робить інверсію правда > брехня, брехня > правда




